# lv2
"""
# 7개 전구 위치별로 인덱스 표기 방법
  0
5    1
  6
4    2
  3

"""
import sys
input = sys.stdin.readline
bulbs = {
    '_': [0,0,0,0,0,0,0],
    '0': [1,1,1,1,1,1,0],
    '1': [0,1,1,0,0,0,0],
    '2': [1,1,0,1,1,0,1],
    '3': [1,1,1,1,0,0,1],
    '4': [0,1,1,0,0,1,1],
    '5': [1,0,1,1,0,1,1],
    '6': [1,0,1,1,1,1,1],
    '7': [1,1,1,0,0,1,0],
    '8': [1,1,1,1,1,1,1],
    '9': [1,1,1,1,0,1,1],
}
t = int(input())
for _ in range(t):
    cnt = 0
    a, b = input().split()
    a = a.rjust(5, '_') # 자릿수 맞추기
    b = b.rjust(5, '_')
    for i in range(5): # 다섯자리 수만큼 반복
        x = a[i]
        y = b[i]
        if x != y:
            for i in range(7): # 각 전구 확인 
                if bulbs[x][i] != bulbs[y][i]:
                    cnt += 1
    print(cnt)
        
